In [3]:
from pandas import read_csv, read_excel

# AFB

In [11]:
afb =  read_excel('./datasets/New_datas_first.xlsx')
target = 'ENIMPAYEOUPAS'
afb.head()

,Unnamed: 0,Type,Fonction,Civilité,Sit.Matrim,Montant,Nbreech.,Taux,ancienneté,age,Mep_Deb,Deb_Prem_Ech,Durée,Motif,ENIMPAYEOUPAS
0,0,CCTTRESORERIE,FONCTIONNAIRE,Monsieur,Celibataire,40488131.0,2,12,1397,75,204,9,0,CCTTRESORERIE,1
1,1,CCTTRESORERIE,FONCTIONNAIRE,Monsieur,Celibataire,40488131.0,2,12,1391,75,0,3,0,CCTTRESORERIE,1
2,2,CCTTRESORERIE,FONCTIONNAIRE,Monsieur,Celibataire,40488131.0,2,12,1402,75,344,12,0,CCTTRESORERIE,1
3,3,CCTTRESORERIE,FONCTIONNAIRE,Monsieur,Celibataire,40488131.0,2,12,1399,75,239,9,0,CCTTRESORERIE,1
4,4,CCTTRESORERIE,FONCTIONNAIRE,Monsieur,Celibataire,40488131.0,2,12,1394,75,111,6,0,CCTTRESORERIE,1

In [7]:
# get unique values
uniq_afb_class = list(afb[target].unique())
uniq_afb_class

['IMPAYE', 'PAYE']

In [8]:
# replacement
# IMPAYE == 1
# PAYE == 0
replacements = {'IMPAYE': 1, 'PAYE': 0}
afb[target] = afb[target].replace(replacements)
print(afb.head())
print(afb.describe())

            Type       Fonction  Civilité   Sit.Matrim     Montant  Nbreech.  \
0  CCTTRESORERIE  FONCTIONNAIRE  Monsieur  Celibataire  40488131.0         2
1  CCTTRESORERIE  FONCTIONNAIRE  Monsieur  Celibataire  40488131.0         2
2  CCTTRESORERIE  FONCTIONNAIRE  Monsieur  Celibataire  40488131.0         2
3  CCTTRESORERIE  FONCTIONNAIRE  Monsieur  Celibataire  40488131.0         2
4  CCTTRESORERIE  FONCTIONNAIRE  Monsieur  Celibataire  40488131.0         2

   Taux  ancienneté  age  Mep_Deb  Deb_Prem_Ech  Durée          Motif  \
0    12        1397   75      204             9      0  CCTTRESORERIE
1    12        1391   75        0             3      0  CCTTRESORERIE
2    12        1402   75      344            12      0  CCTTRESORERIE
3    12        1399   75      239             9      0  CCTTRESORERIE
4    12        1394   75      111             6      0  CCTTRESORERIE

   ENIMPAYEOUPAS
0              1
1              1
2              1
3              1
4              1
            Montant      Nbreech.          Taux    ancienneté           age  \
count  2.895200e+04  28952.000000  28952.000000  28952.000000  28952.000000
mean   2.633315e+06     30.721159     10.266372    988.165343     38.956894
std    2.347014e+07     22.038657      1.003220    619.896938      8.905675
min    2.000000e+05      1.000000      4.000000   -975.000000     10.000000
25%    3.650000e+05     11.000000     10.000000     97.000000     33.000000
50%    9.000000e+05     24.000000     10.000000   1399.000000     37.000000
75%    2.300000e+06     60.000000     11.000000   1410.000000     43.000000
max    3.000000e+09    180.000000     13.000000   1415.000000     90.000000

            Mep_Deb  Deb_Prem_Ech         Durée  ENIMPAYEOUPAS
count  28952.000000  28952.000000  28952.000000   28952.000000
mean      14.179988      0.687897     28.891268       0.248100
std      113.574219      3.922798     22.074544       0.431918
min        0.000000      0.000000      0.000000       0.000000
25%        0.000000      0.000000      9.000000       0.000000
50%        8.000000      0.000000     22.000000       0.000000
75%        8.000000      1.000000     58.000000       0.000000
max     2802.000000     95.000000    119.000000       1.000000

In [9]:
# check the type of class attribut
print(afb.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 28952 entries, 0 to 28951
Data columns (total 14 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Type           28952 non-null  object
 1   Fonction       28952 non-null  object
 2   Civilité       28952 non-null  object
 3   Sit.Matrim     28952 non-null  object
 4   Montant        28952 non-null  float64
 5   Nbreech.       28952 non-null  int64
 6   Taux           28952 non-null  int64
 7   ancienneté     28952 non-null  int64
 8   age            28952 non-null  int64
 9   Mep_Deb        28952 non-null  int64
 10  Deb_Prem_Ech   28952 non-null  int64
 11  Durée          28952 non-null  int64
 12  Motif          28952 non-null  object
 13  ENIMPAYEOUPAS  28952 non-null  int64
dtypes: float64(1), int64(8), object(5)
memory usage: 3.1+ MB
None

In [10]:
# save the actual version to source
afb.to_excel('./datasets/New_datas_first.xlsx')

# CREDIT RISK

In [12]:
cred = read_csv('./datasets/credit_risk_dataset.csv', sep=',')
target = 'loan_status'
cred.head()

,person_age,person_income,person_home_ownership,person_emp_length,loan_intent,loan_grade,loan_amnt,loan_int_rate,loan_status,loan_percent_income,cb_person_default_on_file,cb_person_cred_hist_length
0,22,59000,RENT,123.0,PERSONAL,D,35000,16.02,1,0.59,Y,3
1,21,9600,OWN,5.0,EDUCATION,B,1000,11.14,0,0.10,N,2
2,25,9600,MORTGAGE,1.0,MEDICAL,C,5500,12.87,1,0.57,N,3
3,23,65500,RENT,4.0,MEDICAL,C,35000,15.23,1,0.53,N,2
4,24,54400,RENT,8.0,MEDICAL,C,35000,14.27,1,0.55,Y,4

Detailed data description of Credit Risk dataset:

|Feature Name|	Description|
|:----------:|:------------:|
|person_age|	Age|
|person_income	|Annual Income|
|person_home_ownership	|Home ownership|
|person_emp_length	|Employment length (in years)|
|loan_intent	|Loan intent|
|loan_grade	|Loan grade|
|loan_amnt	|Loan amount|
|loan_int_rate	|Interest rate|
|loan_status	|Loan status (0 is non default 1 is default)|
|loan_percent_income	|Percent income|
|cb_person_default_on_file|	Historical default|
|cb_preson_cred_hist_length	|Credit history length|

Base on this description of [Kaggle Credit Risk Dataset](https://www.kaggle.com/datasets/laotse/credit-risk-dataset), this not pretraiment need on the class

# GERMAN

In [20]:
germ = read_csv('./datasets/private/1. UCI Repository/German/german.csv', sep=',')
target = 'Class'
germ.head()

,Attribute_1,Attribute_2,Attribute_3,Attribute_4,Attribute_5,Attribute_6,Attribute_7,Attribute_8,Attribute_9,Attribute_10,...,Attribute_12,Attribute_13,Attribute_14,Attribute_15,Attribute_16,Attribute_17,Attribute_18,Attribute_19,Attribute_20,Class
0,A11,6,A34,A43,1169,A65,A75,4,A93,A101,...,A121,67,A143,A152,2,A173,1,A192,A201,1
1,A12,48,A32,A43,5951,A61,A73,2,A92,A101,...,A121,22,A143,A152,1,A173,1,A191,A201,2
2,A14,12,A34,A46,2096,A61,A74,2,A93,A101,...,A121,49,A143,A152,1,A172,2,A191,A201,1
3,A11,42,A32,A42,7882,A61,A74,2,A93,A103,...,A122,45,A143,A153,1,A173,2,A191,A201,1
4,A11,24,A33,A40,4870,A61,A73,3,A93,A101,...,A124,53,A143,A153,2,A173,2,A191,A201,2

In [21]:
uniq_germ_class = list(germ[target].unique())
uniq_germ_class

[1, 2]

In [25]:
# replacement based on signification of actual values
# 1 means Good Loans and 
# 2 means Bad loans
germ[target] = germ[target].replace(1,0)
germ[target] = germ[target].replace(2,1)
germ.describe()

,Attribute_2,Attribute_5,Attribute_8,Attribute_11,Attribute_13,Attribute_16,Attribute_18,Class
count,1000.000000,1000.000000,1000.000000,1000.000000,1000.000000,1000.000000,1000.000000,1000.000000
mean,20.903000,3271.258000,2.973000,2.845000,35.546000,1.407000,1.155000,0.300000
std,12.058814,2822.736876,1.118715,1.103718,11.375469,0.577654,0.362086,0.458487
min,4.000000,250.000000,1.000000,1.000000,19.000000,1.000000,1.000000,0.000000
25%,12.000000,1365.500000,2.000000,2.000000,27.000000,1.000000,1.000000,0.000000
50%,18.000000,2319.500000,3.000000,3.000000,33.000000,1.000000,1.000000,0.000000
75%,24.000000,3972.250000,4.000000,4.000000,42.000000,2.000000,1.000000,1.000000
max,72.000000,18424.000000,4.000000,4.000000,75.000000,4.000000,2.000000,1.000000

In [26]:
uniq_germ_class = list(germ[target].unique())
uniq_germ_class

[0, 1]

In [27]:
germ.to_csv('./datasets/private/1. UCI Repository/German/german.csv', sep=',', index=False)